print("--- Gamer ID MAKER ---")
username = input("enter the username: ")
level = input("enter the level: ")
favorite_game = input("enter the favorite game: ")
print("\n")
print("*****************************************")
print("*    GAMER CARD GENERADTED    *")
print("*****************************************")
print("USER:", username)
print("level:", level)
print("playing:"+ favorite_game)
print("*****************************************")




# تمرین ۴: ماشین‌حساب سخنگو (آسان)

# برنامه‌ای بنویسید که دو عدد از کاربر بگیرد و سپس جمع، تفریق و ضرب آن‌ها را به‌صورت جمله کامل چاپ کند.

# راهنمایی: می‌توانید از int(input()) برای گرفتن عدد استفاده کنید و f-string یا جمع رشته‌ها برای ساخت جمله. مثلاً:

# text
# "عدد اول به‌علاوه عدد دوم می‌شود: نتیجه"

# تمرین ۵: شعرساز شخصی (متوسط)

# برنامه‌ای بنویسید که ۴ سوال بپرسد:

#     نام یک شهر؟

#     نام یک رنگ؟

#     یک حس (مثلاً شادی، غم)؟

#     نام یک فصل؟

# سپس یک شعر کوچک ۴ خطی با آن‌ها بسازد. مثلاً:

# text
# "در تهران آبی
# با احساس شادی
# پاییز می‌آید
# و دل‌ها را می‌رباید"

# تمرین ۶: تقویم شخصی (خلاقانه)

# با استفاده از دستور print یک جدول ساده تقویم یک هفته بسازید که نام روزها و یک فعالیت برای هر روز داشته باشد.

# python
# print("┌─────────┬────────────┐")
# print("│ شنبه    │ ورزش      │")
# print("├─────────┼────────────┤")
# print("│ یکشنبه  │ مطالعه     │")
# print("├─────────┼────────────┤")
# print("│ دوشنبه  │ کدنویسی    │")
# print("└─────────┴────────────┘")