print("--- Gamer ID MAKER ---")
username = input("enter the username: ")
level = input("enter the level: ")
favorite_game = input("enter the favorite game: ")
print("\n")
print("*****************************************")
print("*    GAMER CARD GENERADTED    *")
print("*****************************************")
print("USER:", username)
print("level:", level)
print("playing:"+ favorite_game)
print("*****************************************")

# تمرین ۱: طوطی سخنگو (آسان)

# برنامه‌ای بنویسید که یک جمله از کاربر بگیرد و آن را ۳ بار پشت سر هم چاپ کند.

#     راهنمایی: می‌توانید متغیر را ۳ بار در print بنویسید یا از ضرب رشته‌ها ("text" * 3) که نکته انحرافی جذاب است استفاده کنید.

# تمرین ۲: داستان‌ساز خنده‌دار (متوسط)

# برنامه‌ای بنویسید که ۳ سوال بپرسد:

#     نام یک حیوان؟

#     یک صفت (مثلاً عصبانی، خیس)؟

#     نام یک غذا؟

# سپس یک جمله خنده‌دار با آن‌ها بسازد. مثلاً:
# "دیروز یک گربه عصبانی دیدم که داشت قرمه‌سبزی می‌خورد!"
# تمرین ۳: نقاشی با کد (خلاقانه)

# با استفاده از دستور print یک شکل ساده بکشید. مثلاً یک آدمک یا یک خانه.

# python
# print("   /\\")
# print("  /  \\")
# print(" /____\\")
# print(" |    |")
# print(" |____|")
